# -*- ii: true -*-
#+TITLE: Network Booting


*** ss
   #+begin_src shell :dir /sudo::
     sudo ss -ulnp | grep 67
   #+end_src

   #+RESULTS:
   #+begin_example
   UNCONN   0        0              0.0.0.0%virbr0:67               0.0.0.0:*       users:(("dnsmasq",pid=3799,fd=3))                                              
   #+end_example

*** lsof
   #+begin_src shell :dir /sudo::
      sudo lsof -iUDP -n -P | grep 67 
   #+end_src

   #+RESULTS:
   #+begin_example
   dnsmasq   3799 libvirt-dnsmasq    3u  IPv4  58061      0t0  UDP *:67 
   #+end_example

